-- owner
INSERT INTO owner(name) VALUES
('Father');

-- sector
-- 銘柄種別
INSERT INTO sector(name) VALUES
('水産・農林業'), -- 1
('食料品'), -- 2
('鉱業'), -- 3
('石油・石炭製品'), -- 4
('建設業'), -- 5
('金属製品'), -- 6
('ガラス・土石製品'), -- 7
('繊維製品'), -- 8
('パルプ・紙'), -- 9
('化学'), -- 10
('医薬品'), -- 11
('ゴム製品'), -- 12
('輸送用機器'), -- 13
('鉄鋼'), -- 14
('非鉄金属'), -- 15
('機械'), -- 16
('電気機器'), -- 17
('精密機器'), -- 18
('その他製品'), -- 19
('情報・通信業'), -- 20
('サービス業'), -- 21
('電気・ガス業'), -- 22
('陸運業'), -- 23
('海運業'), -- 24
('空運業'), -- 25
('倉庫・運輸関連業'), -- 26
('卸売業'), -- 27
('小売業'), -- 28
('銀行業'), -- 29
('証券、商品先物取引業'), -- 30
('保険業'), -- 31
('その他金融業'), -- 32
('不動産業'); -- 33

-- stock
INSERT INTO stock(code, name, current_price, dividend, release_date, sector_id) VALUES
('3923', 'abc', 2600.0, 0.50, '202503', 1);
