-- owner
INSERT INTO owner(name) VALUES
('Father');

-- sector
-- 銘柄種別
INSERT INTO sector(name) VALUES
('水産・農林業'), -- 1
('食料品'), -- 2
('鉱業'), -- 3
('石油・石炭製品'), -- 4
('建設業'), -- 5
('金属製品'), -- 6
('ガラス・土石製品'), -- 7
('繊維製品'), -- 8
('パルプ・紙'), -- 9
('化学'), -- 10
('医薬品'), -- 11
('ゴム製品'), -- 12
('輸送用機器'), -- 13
('鉄鋼'), -- 14
('非鉄金属'), -- 15
('機械'), -- 16
('電気機器'), -- 17
('精密機器'), -- 18
('その他製品'), -- 19
('情報・通信業'), -- 20
('サービス業'), -- 21
('電気・ガス業'), -- 22
('陸運業'), -- 23
('海運業'), -- 24
('空運業'), -- 25
('倉庫・運輸関連業'), -- 26
('卸売業'), -- 27
('小売業'), -- 28
('銀行業'), -- 29
('証券、商品先物取引業'), -- 30
('保険業'), -- 31
('その他金融業'), -- 32
('不動産業'); -- 33

-- stock
INSERT INTO stock(code, name, current_price, dividend, earnings_date, sector_id) VALUES
('9142', '九州旅客鉄道', 0, 0, NULL, 25),
('3563', 'FOOD & LIFE COMPANIES', 0, 0, NULL, 28),
('9434', 'ソフトバンク', 0, 0, NULL, 20),
('4765', 'ＳＢＩグローバルアセットマネジメント', 0, 0, NULL, 21),
('8473', 'ＳＢＩホールディングス', 0, 0, NULL, 29),
('3763', 'プロシップ', 0, 0, NULL, 20),
('2193', 'クックパッド', 0, 0, NULL, 20),
('3548', 'バロックジャパンリミテッド', 0, 0, NULL, 28),
('9201', '日本航空', 0, 0, NULL, 25),
('5621', 'ヒューマンテクノロジーズ', 0, 0, NULL, 20),
('4704', 'トレンドマイクロ', 0, 0, NULL, 20),
('9449', 'ＧＭＯインターネットグループ', 0, 0, NULL, 20),
('4475', 'HENNGE', 0, 0, NULL, 20),
('9702', 'アイ・エス・ビー', 0, 0, NULL, 20),
('3837', 'アドソル日進', 0, 0, NULL, 20),
('6458', '新晃工業', 0, 0, NULL, 16),
('8002', '丸紅', 0, 0, NULL, 27),
('9757', '船井総研ホールディングス', 0, 0, NULL, 21),
('7374', 'コンフィデンス・インターワークス', 0, 0, NULL, 21),
('9765', 'オオバ', 0, 0, NULL, 21),
('4481', 'ベース', 0, 0, NULL, 20),
('3993', 'PKSHA Technorogy', 0, 0, NULL, 20),
('4071', 'プラスアルファコンサルティング', 0, 0, NULL, 20),
('2432', 'DeNa', 0, 0, NULL, 21),
('3923', 'ラクス', 0, 0, NULL, 20);
